internal/tests/load-test.yaml
config:
  target: "http://localhost:4810/api/v1/photos"
  phases:
    - duration: 10
      arrivalRate: 2000
  plugins:
    expect: {}
scenarios:
  - flow:
      - get:
          url: "/"
hooks:
  afterResponse: |
    function (requestParams, response, context, ee, next) {
      const fs = require('fs');
      const logData = {
        statusCode: response.statusCode,
        body: response.body,
      };
      fs.appendFileSync('responses.log', JSON.stringify(logData) + '\n');
      return next();
    }